StreamAI/Nordic_nRF5_Project/examples/ble_peripheral/ble_app_uart/main.c
/**@brief Resources related to throughput testing.
 */
#define DATA_THROUGHPUT_INTERVAL            APP_TIMER_TICKS(5)                   /**< data throughput interval (ticks). */

APP_TIMER_DEF(m_timer_throughput_id);

#define QUEUE_ELEMENT_NUMBERS               32
#define PKGS_PER_TIMER_PERIOD               8

uint32_t m_data_sent_length = 0;
uint8_t m_data_array[QUEUE_ELEMENT_NUMBERS][BLE_NUS_MAX_DATA_LEN] = {0};
typedef struct
{
    uint8_t * p_data;
    uint16_t length;
} m_element_t;

NRF_QUEUE_DEF(m_element_t, m_buf_queue, QUEUE_ELEMENT_NUMBERS, NRF_QUEUE_MODE_NO_OVERFLOW);


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Use queue to send ble data.
 */
void ble_data_send_with_queue(void)
{
    ret_code_t err_code;
    m_element_t data_item;
    uint16_t length = BLE_NUS_MAX_DATA_LEN;

    while(!nrf_queue_is_empty(&m_buf_queue))
    {
        err_code = nrf_queue_pop(&m_buf_queue, &data_item);
        APP_ERROR_CHECK(err_code);

        length = MIN(length, data_item.length);
        err_code = ble_nus_data_send(&m_nus, data_item.p_data, &length, m_conn_handle);
        if ((err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_NOT_FOUND))
        {
            APP_ERROR_CHECK(err_code);
        }
        if(err_code == NRF_SUCCESS)
            m_data_sent_length += length;
        else
            break;
    }
}


/**@brief Data generation timer timeout handler function.
 */
static void data_throughput_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    
    static uint32_t timeout_count = 0;
    ret_code_t err_code;

    static uint8_t value = 0;
    m_element_t data_item;
    uint16_t length = BLE_NUS_MAX_DATA_LEN;
    uint8_t pkgs = PKGS_PER_TIMER_PERIOD;
    
    timeout_count++;

    while (!nrf_queue_is_full(&m_buf_queue) && pkgs--)
    {
        m_data_array[value % QUEUE_ELEMENT_NUMBERS][0] = value;
        m_data_array[value % QUEUE_ELEMENT_NUMBERS][length-1] = value;

        data_item.p_data = &m_data_array[value % QUEUE_ELEMENT_NUMBERS][0];
        data_item.length = length;

        err_code = nrf_queue_push(&m_buf_queue, &data_item);
        APP_ERROR_CHECK(err_code);

        value++;
    }

    ble_data_send_with_queue();

    // Timer interval 5 ms, when the timer reaches 1 second 
    if(timeout_count == 200)
    {
        // Send m_data_sent_length bytes of data within 1 second, which is equal to m_data_sent_length * 8 / 1024 kilobits of data
        NRF_LOG_INFO("****** BLE data throughput: %d kbps ******", m_data_sent_length >> 7);
        m_data_sent_length = 0;
        timeout_count = 0;
        value = 0;
    }
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create a data generation timer for testing throughput.
    err_code = app_timer_create(&m_timer_throughput_id, 
                                APP_TIMER_MODE_REPEATED, 
                                data_throughput_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }
    }
    else if(p_evt->type == BLE_NUS_EVT_COMM_STARTED)
    {
        // Start data throughput timers.
        ret_code_t err_code;
        err_code = app_timer_start(m_timer_throughput_id, 
                                   DATA_THROUGHPUT_INTERVAL,
                                   NULL);
        APP_ERROR_CHECK(err_code);
    }
    else if(p_evt->type == BLE_NUS_EVT_TX_RDY)
    {
        ble_data_send_with_queue();
    }
}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

